{"acadYear":"2019/2020","preclusion":"GET1009","description":"This module will primarily examine the life and writings of Mohandas Karamchand Gandhi, widely regarded as one of the icons of the twentieth century and one of the principal architects of a free India. The course is meant to not only understand and analyse Gandhi’s thought but also to outline his extraordinary legacy. The course will develop critical thinking and expression of students in two ways. First, it will introduce students to and make them critically engage with Gandhi’s writings and ideas on several issues, including violence and conflict resolution, colonialism, modernity, ethics, science, health and environment. The aim would be to not only expose students to the complexity of Gandhi — the man and his ideas — but to critically interrogate Gandhi and his legacies. Gandhi is particularly suited to such an exercise since he held positions that were often controversial and counter-intuitive, both during his lifetime as well as today.  Second, the students will develop their expression skills, verbal and written, by evaluating Gandhi and his legacy through presentations, take-home assignments and examinations. The students will develop their thinking and expression skills through an analysis not only of texts but also of films and documentaries on Gandhi.","title":"Gandhi's Life, Thought And Legacy","department":"South Asian Studies","faculty":"Arts and Social Science","workload":[2,1,0,0,7],"moduleCredit":"4","moduleCode":"GEK1048","attributes":{"su":true},"aliases":["GET1009"],"semesterData":[{"semester":2,"timetable":[{"classNo":"1","startTime":"1800","endTime":"2000","weeks":[1,2,3,4,5,6,7,8,9,10,11,12,13],"venue":"AS7-0102","day":"Tuesday","lessonType":"Lecture","size":2},{"classNo":"D2","startTime":"1200","endTime":"1400","weeks":[3,5,7,9,11],"venue":"AS3-0308","day":"Wednesday","lessonType":"Tutorial","size":1},{"classNo":"D1","startTime":"1200","endTime":"1400","weeks":[3,5,7,9,11],"venue":"AS4-0603","day":"Monday","lessonType":"Tutorial","size":1}]}]}
