{"acadYear":"2019/2020","preclusion":"LSM1104","description":"This module deals with “General Physiology” and its theme is “Biological Transducers and Energy Transformation”. This module will start with bioenergetics which stresses on the application of thermodynamics to physiological processes in both animals and plants.  Six types of energy will be dealt with, concerning (1) the transformation of light energy to chemical energy by plants, (2) the transformation of chemical energy to chemical potential energy of ions and water across bio-membranes, (3) the transformation of chemical potential energy to electrical energy by plasmalemma with special emphasis on neurons, (4) the transformation of chemical energy to mechanical energy by muscle, and (5) the production and release of heat during energy transformation. Since neurons and muscle tissues require a relatively constant extracellular environment for them to function properly, the important concept of homeostasis will be discussed.  Emphasis will be on extracellular fluid volume and composition.  In addition, mechanisms involved in the balance of heat gain and heat loss to maintain a constant body temperature will be covered.","title":"General Physiology","department":"Biological Sciences","faculty":"Science","workload":[2,0.5,1.5,2,5],"prerequisite":"GCE ‘A’ Level or H2 Biology or equivalent, or LSM1301 or LSM1301X","moduleCredit":"4","moduleCode":"LSM2231","semesterData":[{"semester":1,"timetable":[{"classNo":"1","startTime":"1000","endTime":"1200","weeks":[2,3,4,5,6,7,8,9,10,11,12,13],"venue":"LT34","day":"Friday","lessonType":"Lecture","size":150},{"classNo":"1","startTime":"1400","endTime":"1800","weeks":[1,2,3,4,5,6,7,8,9,10,11,12,13],"venue":"S2-03LAB7","day":"Wednesday","lessonType":"Laboratory","size":150},{"classNo":"1","startTime":"1000","endTime":"1200","weeks":[1],"venue":"LT34","day":"Friday","lessonType":"Tutorial","size":150}],"examDate":"2019-12-02T05:00:00.000Z","examDuration":120}],"fulfillRequirements":["LSM3262","LSM3258","LSM3256"]}
