{"acadYear":"2019/2020","preclusion":"SSU2000% or SSU2004% or SSU2006% or UTS21% or UTC2109 or GEM2909%","description":"This module concentrates on the Asian built environment – architecture, urban planning and sustainable development. The theme of the archaeology of the future considers the many layers of the city, from examining its past to identifying its already emerging possible urban futures. Discussions and readings that provide in-depth, analytical, and critical perspectives on urbanisation and urbanism in Asia will be supplemented with a field trip to URA’s City Gallery and workshops on Futures Thinking. In particular, students will be taught the Casual Layered Analysis (CLA) methodology to help them think critically and deeply about present trends and the multiplicity of future scenarios. Through Singapore as a case study, students will gain a deeper understanding of challenges facing a rapidly-urbanising Asia, cultivate intellectual tools to evaluate these challenges and embody solutions through a hands-on creative project.","title":"Asia Now! The Archaeology of the Future City","department":"Tembusu College","faculty":"Residential College","workload":[3,0,0,0,7],"prerequisite":"This programme is open to students from participating IARU universities and  Tembusu College’s partner colleges.\n\nNUS undergraduates should have a minimum CAP of 3.0 on a 5‐point scale. Non‐NUS students will be assessed based on recruitment criteria and procedures administered by each participating residential college/university in consultation with NUS Tembusu College.\n\nStudents need to have interest in urban Asia, but there is no requirement to have prior background in Asia, Asian Studies, or Asian languages. Ideally, students in this class will be in their second or third year of a four‐year undergraduate program, but in general we will accept undergraduates at any level.\n\nFor Tembusu students - GEM1902% or GEM1912% or UTC11%","moduleCredit":"4","moduleCode":"UTC2109","attributes":{"su":true},"semesterData":[{"semester":1,"timetable":[{"classNo":"2","startTime":"0900","endTime":"1200","weeks":[1,2,3,4,5,6,7,8,9,10,11,12,13],"venue":"TC-SR3","day":"Tuesday","lessonType":"Seminar-Style Module Class","size":16}]}],"prereqTree":{"or":["GEM1902","GEM1912"]}}
